
## Plan Result

[CI link](https://github.com/ruzickap/my-git-projects/actions/runs/17339745125)


<pre><code>Plan: 0 to add, 8 to change, 0 to destroy.</code></pre>

* Update
  * cloudflare_dns_record.ruzicka_dev_mx_records[&#34;mx1&#34;]
  * cloudflare_dns_record.ruzicka_dev_txt_records[&#34;cf2024-1._domainkey&#34;]
  * cloudflare_dns_record.ruzicka_dev_txt_records[&#34;spf&#34;]
  * cloudflare_dns_record.xvx_cz_cname_records[&#34;cestovani&#34;]
  * cloudflare_dns_record.xvx_cz_cname_records[&#34;www.linux&#34;]
  * cloudflare_dns_record.xvx_cz_cname_records[&#34;www.ruzickovabozena&#34;]
  * cloudflare_dns_record.xvx_cz_cname_records[&#34;www.svatba&#34;]
  * cloudflare_pages_project.ruzickap_github_io


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_dns_record.ruzicka_dev_mx_records["mx1"] will be updated in-place
  ~ resource "cloudflare_dns_record" "ruzicka_dev_mx_records" {
        id          = "d0e76697bef0cc42a3bda321c6718b00"
      ~ modified_on = "2025-07-30T17:34:29Z" -> (known after apply)
        name        = "ruzicka.dev"
        tags        = []
        # (10 unchanged attributes hidden)
    }

  # cloudflare_dns_record.ruzicka_dev_txt_records["cf2024-1._domainkey"] will be updated in-place
  ~ resource "cloudflare_dns_record" "ruzicka_dev_txt_records" {
        id          = "b57d74c4207949419eed79426a79ada8"
      ~ modified_on = "2025-07-30T17:34:29Z" -> (known after apply)
        name        = "cf2024-1._domainkey.ruzicka.dev"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # cloudflare_dns_record.ruzicka_dev_txt_records["spf"] will be updated in-place
  ~ resource "cloudflare_dns_record" "ruzicka_dev_txt_records" {
        id          = "7ad39b456f39cd4be7a205f3d3d01b2b"
      ~ modified_on = "2025-07-30T17:34:29Z" -> (known after apply)
        name        = "ruzicka.dev"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # cloudflare_dns_record.xvx_cz_cname_records["cestovani"] will be updated in-place
  ~ resource "cloudflare_dns_record" "xvx_cz_cname_records" {
        id          = "2071b139d06452a796ea0c6c90e01164"
      ~ modified_on = "2025-08-30T05:10:53Z" -> (known after apply)
        name        = "cestovani.xvx.cz"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # cloudflare_dns_record.xvx_cz_cname_records["www.linux"] will be updated in-place
  ~ resource "cloudflare_dns_record" "xvx_cz_cname_records" {
        id          = "710ca1eb4e3dbbc6595c311e35fa7dca"
      ~ modified_on = "2025-08-30T05:10:53Z" -> (known after apply)
        name        = "www.linux.xvx.cz"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # cloudflare_dns_record.xvx_cz_cname_records["www.ruzickovabozena"] will be updated in-place
  ~ resource "cloudflare_dns_record" "xvx_cz_cname_records" {
        id          = "10d8f0bd9f189c6fab3296e8f4304d4a"
      ~ modified_on = "2025-08-30T05:10:53Z" -> (known after apply)
        name        = "www.ruzickovabozena.xvx.cz"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # cloudflare_dns_record.xvx_cz_cname_records["www.svatba"] will be updated in-place
  ~ resource "cloudflare_dns_record" "xvx_cz_cname_records" {
        id          = "b6821c7dd6a57fa6ced05d9ba7220bf6"
      ~ modified_on = "2025-08-30T05:10:53Z" -> (known after apply)
        name        = "www.svatba.xvx.cz"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # cloudflare_pages_project.ruzickap_github_io will be updated in-place
  ~ resource "cloudflare_pages_project" "ruzickap_github_io" {
      - build_config         = {} -> null
      ~ canonical_deployment = {
          + aliases            = (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-08-10T16:35:16Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  ~ commit_hash    = "c9ba0129b0c20b037f26f84ec5112768da1685bc" -> (known after apply)
                  ~ commit_message = "chore(main): release 1.0.0" -> (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "4838aba2-8f74-4729-ac17-4946499e0e47" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-08-10T16:35:18Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-08-10T16:35:18Z" -> (known after apply)
          ~ project_id         = "59418a45-7a28-47bc-9b3a-12d9d882a4f3" -> (known after apply)
          ~ project_name       = "ruzickap-github-io" -> (known after apply)
          ~ short_id           = "4838aba2" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-08-10T16:35:16Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-08-10T16:35:18Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://4838aba2.ruzickap-github-io.pages.dev" -> (known after apply)
        } -> (known after apply)
      ~ created_on           = "2025-06-25T13:46:04Z" -> (known after apply)
      - deployment_configs   = {
          - preview    = {
              - compatibility_date  = "2025-06-25" -> null
              - compatibility_flags = [] -> null
            } -> null
          - production = {
              - compatibility_date  = "2025-06-25" -> null
              - compatibility_flags = [] -> null
            } -> null
        } -> null
      ~ domains              = [
          - "ruzickap-github-io.pages.dev",
        ] -> (known after apply)
        id                   = "ruzickap-github-io"
      ~ latest_deployment    = {
          + aliases            = (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-08-10T16:35:16Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  ~ commit_hash    = "c9ba0129b0c20b037f26f84ec5112768da1685bc" -> (known after apply)
                  ~ commit_message = "chore(main): release 1.0.0" -> (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "4838aba2-8f74-4729-ac17-4946499e0e47" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-08-10T16:35:18Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-08-10T16:35:18Z" -> (known after apply)
          ~ project_id         = "59418a45-7a28-47bc-9b3a-12d9d882a4f3" -> (known after apply)
          ~ project_name       = "ruzickap-github-io" -> (known after apply)
          ~ short_id           = "4838aba2" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-08-10T16:35:16Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-08-10T16:35:18Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://4838aba2.ruzickap-github-io.pages.dev" -> (known after apply)
        } -> (known after apply)
        name                 = "ruzickap-github-io"
      ~ subdomain            = "ruzickap-github-io.pages.dev" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 8 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tofu-cloudflare","PRNumber":190,"Program":"tfcmt","SHA1":"9a9a5a5291bbd17b9a9ee57c00a3a0db55e9128b","Vars":{},"WorkflowName":"tofu-cloudflare"} -->